# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or `~/dotfiles.sh`.
#
# See https://github.com/Homebrew/homebrew-bundle

tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
# tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"

brew "gnupg"                                # GNU privacy guard
brew "zsh"                                  # Z shell
brew "colordiff"                            # Colour-highlighted diff output
brew "direnv"                               # Directory specific env variables
brew "less"                                 # Terminal pager
brew "lesspipe"                             # Input filter for `less`
brew "fswatch"                              # File change monitor
brew "geoip"                                # Geographic IP lookup
brew "htop"                                 # Interactive system-monitor
brew "neofetch"                             # System information tool
brew "fzf"                                  # A command line fuzzy finder
brew "fd"                                   # A command line Find files
brew "bat"                                  # A better cat
brew "ripgrep"                              # Recursive Regex search tool
brew "rsync"                                # File transfer and sync tool
brew "screenfetch"                          # Screenshot information tool
brew "starship"                             # Starship cross-shell prompt
brew "telnet"                               # Virtual terminal client
brew "tmuxinator"                           # Tmux session controller
brew "unison"                               # Unison file synchronizer
brew "wget"                                 # Web content downloader
brew "zlib"                                 # Lossless data-compression library
brew "rich"
brew "ydiff"
brew "watchman"

#brew "graphicsmagick"                      # GraphicsMagick image processor
#brew "imagemagick"                         # ImageMagick image processor
brew "jpegoptim"                            # JPEG compressor/optimizer
#brew "optipng"                             # PNG compressor/optimizer

brew "tidy-html5"                           # HTML corrector

brew "helm"
brew "kubectx"
brew "hashicorp/tap/terraform"
brew "hugo"
# brew "chezmoi"                              # Chezmoi dotfiles manager
